        *> Compile: cobc -x -free len.cbl
*>      $ SET SOURCEFORMAT"FREE"
IDENTIFICATION DIVISION.
PROGRAM-ID.  len.
AUTHOR.  Mark Carter.
*> performs tests on line length.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 INP PIC X(5).
01 BUFFER PIC X(100).
01 AGAIN PIC X.
01 BUFL PIC 9(3).

PROCEDURE DIVISION.
Begin.
    *> 
    DISPLAY "INPUT SOME TEXT WHEN LINE LENGTH is " length of INP.
    ACCEPT INP.
    DISPLAY "I RECOGNISE LINE AS:"
    DISPLAY "[" INP "]".
    *> DISPLAY "AGAIN? (n to quit)"
    *> ACCEPT AGAIN
    *> IF AGAIN NOT = "n"
    *>  GO TO Begin
    *> END-IF.

Using-buffer.
    DISPLAY "NOW LET'S TRY SOME BUFFERING - ENTER SOME TEXT:"
    ACCEPT BUFFER.
    INSPECT FUNCTION REVERSE(BUFFER) TALLYING BUFL FOR LEADING SPACES
    COMPUTE BUFL = LENGTH OF BUFFER - BUFL.
    DISPLAY "THE LENGTH OF THE INPUT COMPUTED AS " BUFL

    STOP RUN.

