001000 IDENTIFICATION DIVISION.
001010 PROGRAM-ID. ???.

002000 ENVIRONMENT DIVISION.
002010 INPUT-OUTPUT SECTION.

003000 DATA DIVISION.
003010 FILE SECTION.
003020 WORKING-STORAGE SECTION.
003030 LOCAL-STORAGE SECTION.
003040 LINKAGE SECTION.

004000 PROCEDURE DIVISION.
       program-begin.
       program-done.
           stop run.
